<?php
/**
 * 中间件的接口.
 *
 * 所有中间件都要实现本接口
 *
 * 每个中间件的开销：
 * <ul>
 * <li>setApp</li>
 * <li>setNext</li>
 * <li>call</li>
 * </ul>
 *
 *
 * 著名的洋葱卷：
 * <pre>
 *
 *     ----------------------------------------
 *    |                        CatchAll        |
 *    |  --------------------------------------|
 *    | |                      Profiler        |
 *    | |  ------------------------------------|
 *    | | |                    MiddlewareN...  |    
 *    | | |  ----------------------------------|
 *    | | | |                  MiddlewareN-1   |
 *    | | | |  --------------------------------|
 *    | | | | |                App --> Action  |
 *    | | | |  --------------------------------|
 *    | | | |                                  |
 *    | | |  ----------------------------------|
 *    | | |                                    |
 *    | |  ------------------------------------|
 *    | |                                      |
 *    |  --------------------------------------|
 *    |                                        |
 *     ----------------------------------------
 *
 * </pre>
 *
 * @category http
 * @package http
 * @version $Id:$
 * @author gaopeng <gaopeng@corp.kaixin001.com>
 *
 * vim: set sw=4 ts=4 et:
 */
interface DHttp_IMiddleware
{

    /**
     * 中间件的真正执行逻辑.
     *
     * 从app里获取request/response，并可以更改其值，从而控制行为。
     * 此外，还可以通过{@link DHttp_App}的hook，实现更大范围生命
     * 周期的行为
     *
     * 自主决定是否调用下一个中间件接力棒，如果不调，则表示直接输出了
     */
    public function call();

}
